Revit 2025 API
AnalysisDisplayStyleVectorArrowheadScale Enumeration
 Defines arrow head scaling for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AnalysisDisplayStyleVectorArrowheadScale
Public Enumeration AnalysisDisplayStyleVectorArrowheadScale
public enum class AnalysisDisplayStyleVectorArrowheadScale
type AnalysisDisplayStyleVectorArrowheadScale
Members
Member name | Value | Description
NoScaling | 0
Length5Percent | 1
Length10Percent | 2
Length15Percent | 3
Length20Percent | 4
NoArrow | 5
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace